# IsValidLoopId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder..::..IsValidLoopId Method
BRepBuilder Class See Also
---
A validator function that checks whether the loop id corresponds to a loop previously added to this BRepBuilder object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValidLoopId(
	BRepBuilderGeometryId loopId
)
```

Visual Basic
---
```text
Public Function IsValidLoopId ( _
	loopId As BRepBuilderGeometryId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidLoopId(
	BRepBuilderGeometryId^ loopId
)
```

# ### Parameters
loopId
    Type: Autodesk.Revit.DB..::..BRepBuilderGeometryId Loop id to be validated.
# ### Return Value
True if loopId corresponds to a loop previously added to this BRepBuilder, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace